E2EClient/xml_template/OD/01_option_delete.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://webservice" xmlns:m1="java:xml_soapadapter">
  <soapenv:Body>
<m:assetComponent xmlns:m="http://webservice">
<m:AssetComponentIN>
        <m1:OrganizationCode>500</m1:OrganizationCode>
        <m1:CustomerCode>SW_CUST_AUTO_XXXX</m1:CustomerCode>
        <m1:BillingAccountId>SW_ACCT_AUTO_XXXX</m1:BillingAccountId>
        <m1:Product>
          <m1:SOId>1</m1:SOId>
          <m1:RootInstanceId>SW_ROOTINST_AUTO_XXXX</m1:RootInstanceId>
          <m1:ParentInstanceId>SW_ROOTINST_AUTO_XXXX</m1:ParentInstanceId>
          <m1:ProductInstanceId>SW_PRODINST_AUTO_XXXX</m1:ProductInstanceId>
          <m1:ActionCode>Delete</m1:ActionCode>
          <m1:ActionType />
          <m1:LineNumber />
          <m1:ProductCatalogId>SW_OPTIONCATALOG_ID_XXX</m1:ProductCatalogId>
	<m1:ServiceId></m1:ServiceId>      
          <m1:TariffId>SW_BASE_TARIFF_XXXX</m1:TariffId>
          <m1:StartDate>SW_PVT_XXX</m1:StartDate>
          <m1:ModifyDate></m1:ModifyDate>
          <m1:EndDate>09/11/2023 01:39:57</m1:EndDate>
          <m1:DisconnectionDate />
          <m1:OrderTotal />
          <m1:OrderCurrency />
          <m1:DisconnectionRequested />
          <m1:BillingCharged>N</m1:BillingCharged>
          <m1:OrderChannel />
          <m1:OrderTypeCode />
          <m1:OrderSubTypeCode />
          <m1:OrderReason />
 <m1:ListOfAttributes>
	SW_LIST_ATTR1_XXXXSW_LIST_ATTR2_XXXXSW_LIST_ATTR3_XXXXSW_LIST_ATTR4_XXXXSW_ERA_TAG_ATTR_XXXXSW_LIST_OVERSTART_XXXXSW_LIST_OVEREND_XXXXSW_LIST_OVERPF_XXXX
	<m1:Attribute>
              <m1:ActionCode>Delete</m1:ActionCode>
              <m1:Name>Data disattivazione Canone</m1:Name>
              <m1:Value>SW_Data_disattivazione_Canone_XXXX</m1:Value>
        </m1:Attribute>
 </m1:ListOfAttributes>
        </m1:Product>
      </m:AssetComponentIN>
    </m:assetComponent>
</soapenv:Body>
</soapenv:Envelope>	